projectTemplate/design0/stroke_2mm/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.1  0.1 -0.2)
    ( 0.1  0.1 -0.2)
    ( 0.1  0.1  0.2)
    (-0.1  0.1  0.2)
    (-0.1 -0.1 -0.2)
    ( 0.1 -0.1 -0.2)
    ( 0.1 -0.1  0.2)
    (-0.1 -0.1  0.2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (50 100 50) // cell size 4[mm]
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

// ************************************************************************* //